Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རིམ་གྲོ་པ་ནི་ཀླུའི་བདག་པོ་ཁྱིམ་བློ་ཅན་ཞེས་བྱའོ། །
en: Possessor of the Mind of the Home of the Nāga Lord will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འགྲོ་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའི་སྣང་བ་ཐོབ་པ་ཞེས་བྱའོ། །
en: Attaining the Illumination That Pacifies All Wandering Beings will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྟོགས་པ་དང་བློ་གྲོས་ཀྱིས་ཡོངས་སུ་སྤངས་པར་སེམས་པ་ཞེས་བྱའོ། །
en: Attentive to Relinquishment by Means of Realization and Intelligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བདུན་ཅུ་རྩ་དགུ་དགུའོ། །
en: There will be twenty-two consecutive congregations of worthy ones, each of them gathering seven hundred ninety million.

source: དེ་བཞིན་གཤེགས་པ་དྲེགས་པ་སྤངས་པ་སྐྱེ་བའི་ཡུལ་ནི་མཁས་པའི་བློ་གྲོས་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Madaprahīṇa will be born in a place called Possessor of Learned Intelligence.

source: ཡབ་ནི་ཁེངས་པ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Mind Free from Arrogance will be his father.

source: ཡུམ་ནི་སྤྱོད་པ་མ་འཁྲུལ་ཞེས་བྱའོ། །
en: Conduct Free from Delusion will be his mother.

source: སྲས་ནི་སེང་གེའི་མཐུ་རྩལ་དོར་ཞེས་བྱའོ། །
en: Relinquishment with Leonine Strength will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོད་མཆོག་ཐོབ་ཅེས་བྱའོ། །
en: Attainment of Supreme Worship will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཕགས་པ་ལ་དད་པའི་ཏོག་ཅེས་བྱའོ། །
en: Crest of Faith in Noble Beings will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲང་སྲོང་སྤྱོད་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligent Conduct of the Sages will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བདུན་ཏེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་ལྔ་ལྔའོ། །
en: There will be seven consecutive congregations of worthy ones, each of them gathering five billion.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་མཛོད་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་མཐའ་ཡས་པ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Jñānakośa will be born in a place called Array of Infinite Qualities.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱད་ཙམ་མོ། །
en: His light will extend as far as eight worlds of four continents.

source: ཡབ་ནི་གཟུགས་ཀྱི་བརྡ་ཟད་མི་ཤེས་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Inexhaustible Intelligence Regarding the Symbols of Form will be his father.

source: ཡུམ་ནི་འོད་གསལ་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Luminous Intelligence will be his mother.

source: རིམ་གྲོ་པ་ནི་ཀླུ་དབྱངས་སེམས་པ་ཞེས་བྱའོ། །
en: Mind of Melodious Song will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བའི་རིན་པོ་ཆེ་ལ་རབ་ཏུ་གནས་པ་ཞེས་བྱའོ། །
en: Residing within Precious Liberation will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོན་པ་གསལ་བ་བརྩེགས་ཞེས་བྱའོ། །
en: Teacher of the Luminous Mount will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་བརྒྱད་བརྒྱད་དོ། །
en: There will be fourteen consecutive congregations of worthy ones, each of them gathering two hundred eighty million.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པར་གཤེགས་པ་སྐྱེ་བའི་ཡུལ་ནི་སྙིང་རྗེ་དང་གཏི་མུག་མེད་པ་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: “The thus-gone Brahmagāmin will be born in a place called Jewel of Compassion and Freedom from Ignorance.

source: ཡབ་ནི་སྙིང་རྗེ་ཆེར་སེམས་ཞེས་བྱའོ། །
en: Mind of Great Compassion will be his father.

source: ཡུམ་ནི་སྒྲིབ་མེད་བྱམས་པ་མཐོང་ཞེས་བྱའོ། །
en: Vision of Unobscured Love will be his mother.

source: སྲས་ནི་བལྟ་བཟོད་ཅེས་བྱའོ། །
en: Accepting the View will be his son.

source: རིམ་གྲོ་པ་ནི་ལུས་བཟངས་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Splendor of Excellent Body will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ཐམས་ཅད་ཡང་དག་པར་འཕགས་པ་ཞེས་བྱའོ། །
en: Truly Superior Totality of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཀོད་པ་ཀུན་ཏུ་མཛེས་པ་ཞེས་བྱའོ། །
en: Beautiful Array will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅུ་དྲུག་བཅུ་དྲུག་གོ། །
en: There will be seventy consecutive congregations of worthy ones, each of them gathering one million six hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ཙན་དན་སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་བརྟན་ཞེས་བྱའོ། །
en: “The thus-gone Candana will be born in a place called Land of Courage.

source: ཡབ་ནི་མཁས་བརྩོན་ཞེས་བྱའོ། །
en: Learned Diligence will be his father.

source: ཡུམ་ནི་བརྩོན་པ་མི་གཏོང་བ་ཞེས་བྱའོ། །
en: Unrelenting Diligence will be his mother.

source: སྲས་ནི་མཐུ་རྩལ་གནས་ཞེས་བྱའོ། །
en: Powerful Abiding will be his son.

source: རིམ་གྲོ་པ་ནི་གཞན་གྱིས་མི་ཐུབ་པའི་མཐུ་རྩལ་ཅན་ཞེས་བྱའོ། །
en: Indomitable Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་མཐུ་རྩལ་སྦྱིན་ཞེས་བྱའོ། །
en: Gift of Powerful Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་མཆོད་འོས་ཐོབ་ཅེས་བྱའོ། །
en: Attainment Worthy of the World’s Worship will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be ninety consecutive congregations of worthy ones, each of them gathering six hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པ་སྐྱེ་བའི་ཡུལ་ནི་མྱ་ངན་དང་བྲལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Aśoka will be born in a place called Free from Suffering.

source: འོད་ནི་དཔག་ཚད་ཉི་ཁྲི་བཞི་སྟོང་ངོ་། །
en: His light will extend twenty-four thousand leagues.

source: ཡབ་ནི་གསལ་དག་ཅེས་བྱའོ། །
en: Pure Clarity will be his father.

source: ཡུམ་ནི་མྱ་ངན་ཐམས་ཅད་གཏོང་ཞེས་བྱའོ། །
en: Relinquishing All Suffering will be his mother.

source: སྲས་ནི་སྨོན་ལམ་མ་འཁྲུལ་བ་ཞེས་བྱའོ། །
en: Flawless Aspiration will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་མ་འཛིངས་པ་ཞེས་བྱའོ། །
en: Unperturbed Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མ་འདྲེས་པར་སེམས་པ་ཞེས་བྱའོ། །
en: Attention without Blurriness will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྟ་གསལ་བློ་ཅན་ཞེས་བྱའོ། །
en: Endowed with the Mind of the Clear View will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be thirty consecutive congregations of hearers, each of them gathering three hundred twenty million.

source: དམ་པའི་ཆོས་ནི་ལོ་དགུ་ཁྲི་དགུ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for ninety-nine thousand years.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་འོད་ཟེར་སྐྱེ་བའི་ཡུལ་ནི་བདག་མེད་པ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Siṃharaśmi will be born in a place called Endowed with the Absence of Self.

source: ཡབ་ནི་ཆོས་མཐོང་ཞེས་བྱའོ། །
en: Seeing the Dharma will be his father.

source: ཡུམ་ནི་སྟོང་པ་ཉིད་ལ་གནས་པ་ཞེས་བྱའོ། །
en: Abiding by Emptiness will be his mother.

source: སྲས་ནི་ཀུན་ཏུ་ལྟ་བ་ཅན་ཞེས་བྱའོ། །
en: Possessor of Universal View will be his son.

source: རིམ་གྲོ་པ་ནི་བཀོད་པ་མི་གནས་པ་ཞེས་བྱའོ། །
en: Indeterminate Array will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོངས་མཐོང་བློ་ངེས་ཞེས་བྱའོ། །
en: Certain Mind of Complete Vision will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be thirty-two consecutive congregations of hearers, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ཡུལ་འཁོར་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་མཐའ་ཡས་ཏོག་ཅེས་བྱའོ། །
en: “The thus-gone Keturāṣṭra will be born in a place called Crest of Infinite Lands.

source: ཡབ་ནི་ཏོག་གི་ང་རོ་ཞེས་བྱའོ། །
en: Crest Roar will be his father.

source: ཡུམ་ནི་ཏོག་འབྲངས་ཞེས་བྱའོ། །
en: Crest Follower will be his mother.

source: སྲས་ནི་མཐའ་ཡས་ཏོག་ཅེས་བྱའོ། །
en: Infinite Crest will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་རིན་ཆེན་རྣམ་པར་གྲགས་ཞེས་བྱའོ། །
en: Renown of Precious Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་ཏོག་གསལ་ཞེས་བྱའོ། །
en: Luminous Crest of Insight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་དགའ་ཁ་ལོ་སྒྱུར་ཞེས་བྱའོ། །
en: Leader of Joyous Gods will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་སྟོང་ཕྲག་བཅྭ་ལྔ་བཅྭ་ལྔའོ། །
en: There will be twelve consecutive congregations of hearers, each of them gathering fifteen thousand.

source: དེ་བཞིན་གཤེགས་པ་པད་མའི་སྙིང་པོ་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་ཐམས་ཅད་འབྱུང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Padmagarbha will be born in a place called Growing of All Flowers.

source: ཡབ་ནི་སྙན་པ་ཐོབ་ཅེས་བྱའོ། །
en: Accomplishment of the Approach will be his father.

source: ཡུམ་ནི་ཡེ་ཤེས་ཅན་ཞེས་བྱའོ། །
en: Endowed with Wisdom will be his mother.

source: སྲས་ནི་གཞལ་མེད་གཟི་བརྗིད་བཟང་པོ་ཞེས་བྱའོ། །
en: Unfathomable Excellent Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷའི་ཚོགས་ཀྱི་ལྷ་ཞེས་བྱའོ། །
en: God of the Gathering of Gods will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྟ་བ་ཚོད་ཅེས་བྱའོ། །
en: Measure of the View will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྟ་བ་མཐའ་ཡས་འཕགས་ཞེས་བྱའོ། །
en: Superior Infinite View will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅྭ་བརྒྱད་བཅྭ་བརྒྱད་དོ། །
en: There will be seventy consecutive congregations of hearers, each of them gathering one hundred eighty million.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་མཐའ་ཡས་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་གཟི་བརྗིད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Anantatejas will be born in a place called Adorned with Splendid Qualities.

source: ཡབ་ནི་ལྷས་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by Gods will be his father.

source: ཡུམ་ནི་འོད་སྦྱིན་མ་ཞེས་བྱའོ། །
en: Light Gift will be his mother.

source: རིམ་གྲོ་པ་ནི་མཐའ་ཡས་བློ་ཞེས་བྱའོ། །
en: Infinite Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགེ་བ་ཀུན་ཏུ་འབྱུང་བ་ཞེས་བྱའོ། །
en: Source of Virtue will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སོ་བཟངས་ཞེས་བྱའོ། །
en: Excellent Sharpness will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be sixty consecutive congregations of hearers, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་ལྷའི་འོད་ཟེར་སྐྱེ་བའི་ཡུལ་ནི་ལྷ་དད་ཅེས་བྱའོ། །
en: “The thus-gone Devaraśmi will be born in a place called Divine Faith.

source: ཡབ་ནི་མཐུ་རྩལ་མི་གཡོ་བ་ཞེས་བྱའོ། །
en: Unshakable Power will be his father.

source: ཡུམ་ནི་མཆོད་དོན་ཞེས་བྱའོ། །
en: Meaningful Worship will be his mother.

source: སྲས་ནི་མཆོད་འདོད་ཅེས་བྱའོ། །
en: Wish for Worship will be his son.

source: རིམ་གྲོ་པ་ནི་མེ་ཏོག་བྱིན་ཞེས་བྱའོ། །
en: Flower Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དོན་ཆེན་ཐོབ་ཅེས་བྱའོ། །
en: Attaining the Great Objective will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིན་ཏུ་མཐུ་རྩལ་སྟོབས་ཞེས་བྱའོ། །
en: Tremendous Power will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be seventy consecutive congregations of hearers, each of them gathering six hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་མེ་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: “The thus-gone Prajñāpuṣpa will be born in a place called Precious Flower.

source: ཡབ་ནི་ཡོན་ཏན་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Qualities will be his father.

source: ཡུམ་ནི་བདུད་རྩིའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Nectar Flower will be his mother.

source: སྲས་ནི་བསོད་ནམས་མེ་ཏོག་ཅེས་བྱའོ། །
en: Merit Flower will be his son.

source: རིམ་གྲོ་པ་ནི་མྱ་ངན་ལས་འདས་པའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Nirvāṇa will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་གྱི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of the World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་མེ་ཏོག་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of the Precious Flower will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be sixteen consecutive congregations of hearers, each of them gathering three million.

source: དེ་བཞིན་གཤེགས་པ་མཁས་པ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Vidvat will be born in a place called Jewel Array.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་ཅུ་རྩ་བཞིའོ། །
en: His light will extend eighty-four leagues.

source: ཡབ་ནི་པད་མའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Lotus Essence will be his father.

source: ཡུམ་ནི་མེ་ཏོག་བཟང་པོའི་གཟི་བྱིན་མ་ཞེས་བྱའོ། །
en: Splendid Gift of Excellent Flowers will be his mother.

source: སྲས་ནི་བསོད་ནམས་གཟི་བརྗིད་གཟུགས་བརྙན་གཟི་བྱིན་སེམས་ཞེས་བྱའོ། །
en: Splendid Mind of Reflecting Splendid Merit will be his son.

source: རིམ་གྲོ་པ་ནི་སྤ་གོས་ཞེས་བྱའོ། །
en: Donning Courage will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོད་སྦྱིན་གོ་བགོས་ང་རོའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Endowed with a Roaring Mind while Donning the Robes of Sacrifice will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འོད་གསལ་དྲི་མེད་སེམས་ཞེས་བྱའོ། །
en: Mind of Stainless Luminosity will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be fourteen consecutive congregations of hearers, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འབྱོར་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་འབྱོར་པ་ཞེས་བྱའོ། །
en: “The thus-gone Samṛddhajñāna will be born in a place called Jewel Riches.

source: འོད་ནི་དཔག་ཚད་དགུ་བརྒྱའོ། །
en: His light will extend nine hundred leagues.

source: ཡབ་ནི་རིན་ཆེན་གཟི་བརྗིད་སྣང་བ་ཅེས་བྱའོ། །
en: Splendid Jewel Light will be his father.

source: སྲས་ནི་རིན་པོ་ཆེའི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Jewel Source will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་པོ་ཆེའི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Jewel Lamp will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Jewel will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཟང་མཆོག་དཔལ་ཞེས་བྱའོ། །
en: Glory of Supreme Excellence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be nineteen consecutive congregations of hearers, each of them gathering three million.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱིག་སྐྱེ་བའི་ཡུལ་ནི་དབྱིག་སྣང་ཞེས་བྱའོ། །
en: “The thus-gone Brahmavasu will be born in a place called Shining Treasure.

source: ཡབ་ནི་གཟུངས་ཀྱི་ང་རོ་ཞེས་བྱའོ། །
en: Roar of Retention will be his father.

source: ཡུམ་ནི་ཚངས་མཆོག་དཔལ་ཞེས་བྱའོ། །
en: Glory of Supreme Brahmā will be his mother.

source: སྲས་ནི་ཐར་པ་ལ་དམིགས་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King Observing Liberation will be his son.

source: རིམ་གྲོ་པ་ནི་ཕུང་པོ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Mass will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པའི་རྒྱལ་མཚན་རྒྱལ་ཆེན་ཞེས་བྱའོ། །
en: Great Royal Banner of Fame will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་བདུད་རྩི་གནས་ཞེས་བྱའོ། །
en: Source of the Nectar of Power will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be eighty-eight consecutive congregations of hearers, each of them gathering eight hundred million.

source: དེ་བཞིན་གཤེགས་པ་ཕྱག་ན་རིན་ཆེན་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnapāṇi will be born in a place called Jewel Array.

source: ཡབ་ནི་རིན་ཆེན་ལག་ཅེས་བྱའོ། །
en: Jewel Hand will be his father.

source: ཡུམ་ནི་རིན་ཆེན་མཐའ་ཡས་མ་ཞེས་བྱའོ། །
en: Infinite Jewels will be his mother.

source: སྲས་ནི་ཡོན་ཏན་རྣམ་པར་ལྟ་ཞེས་བྱའོ། །
en: Viewing Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་མིག་ཅེས་བྱའོ། །
en: Jewel Eye will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་བཀོད་པའི་ལུས་ཞེས་བྱའོ། །
en: Bodily Array of Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལུས་མ་སྨད་ཅེས་བྱའོ། །
en: Irreproachable Body will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be fourteen consecutive congregations of hearers, each of them gathering six million.

source: དེ་བཞིན་གཤེགས་པ་དབང་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་དབང་པོའི་རྒྱན་བཀོད་པ་རྣམ་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Indrama will be born in a place called Famed Array of the Ornaments of the Faculties.

source: ཡབ་ནི་དབང་པོས་བྱིན་ཞེས་བྱའོ། །
en: Faculty Gift will be his father.

source: ཡུམ་ནི་ལྷ་མ་ཡིན་གྱི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Demigods will be his mother.

source: སྲས་ནི་དབང་གསལ་བྱིན་ཞེས་བྱའོ། །
en: Gift of Clear Faculties will be his son.

source: རིམ་གྲོ་པ་ནི་དཔལ་བརྩེགས་དབང་པོ་བརྟན་ཞེས་བྱའོ། །
en: Stable Faculties of Amassed Glory will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་སྣང་བྱེད་རྒྱལ་མཚན་གྲགས་པ་གསལ་ཞེས་བྱའོ། །
en: Famed Banner of Illumination will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆགས་པ་མེད་པར་གནས་པ་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: Expert in Remaining Detached will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་དྲུག་ཅུ་དྲུག་ཅུའོ། །
en: There will be thirty-six consecutive congregations of hearers, each of them gathering sixty billion.

source: དེ་བཞིན་གཤེགས་པ་རྫོགས་པར་གསུང་བ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Anupamavādin will be born in a place called Great Array.

source: ཡབ་ནི་མི་ཐུབ་ཐུལ་ཞེས་བྱའོ། །
en: Capable Tamer will be his father.

source: སྲས་ནི་བློ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Mind will be his son.

source: རིམ་གྲོ་པ་ནི་ཞི་བ་གསལ་ཞེས་བྱའོ། །
en: Luminous Peace will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཕགས་དད་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Noble Faith will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་གདོན་མི་ཟ་བའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King Beyond Doubt will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be eighty-four consecutive congregations of hearers, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་མཆོག་གསུང་སྐྱེ་བའི་ཡུལ་ནི་ཤིན་ཏུ་བལྟ་ན་གསལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Jyeṣṭhavādin will be born in a place called Extremely Clear View.

source: ཡབ་ནི་འོད་མཆོག་དཔལ་ཞེས་བྱའོ། །
en: Glorious Supreme Light will be his father.

source: ཡུམ་ནི་ཟིལ་གྱིས་མི་ནོན་པའི་མདོག་ཅན་ཞེས་བྱའོ། །
en: Bearer of Indomitable Colors will be his mother.

source: སྲས་ནི་རྣམ་གྲགས་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Fame will be his son.

source: རིམ་གྲོ་པ་ནི་བདུད་རྩིའི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Nectar Lamp will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་མཐའ་ཡས་སྤྱད་པའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Possessor of the Mind That Partakes of Infinite Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲ་ལ་ཆགས་པ་མེད་པར་སྟོན་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligence That Teaches without Attachment to Language will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བདུན་ཅུ་རྩ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བརྒྱད་བརྒྱད་དོ། །
en: There will be seventy-eight consecutive congregations of hearers, each of them gathering eight million eight hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་མཆོད་འོས་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Pūjya will be born in a place called Infinite Splendor.

source: ཡབ་ནི་དོན་དཔྱོད་ཅེས་བྱའོ། །
en: Discerning the Meaning will be his father.

source: ཡུམ་ནི་སྐར་འོད་ཅན་ཞེས་བྱའོ། །
en: Endowed with Starlight will be his mother.

source: རིམ་གྲོ་པ་ནི་འཕགས་པ་དད་ཅེས་བྱའོ། །
en: Superior Faith will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འགྲོ་བས་མཆོག་ཅེས་བྱའོ། །
en: Worshiped by the World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་སྤོབས་པ་རྣམ་པར་ངེས་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Certainty of Insight and Acumen will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be eighty-four consecutive congregations of hearers, each of them gathering three hundred million.

source: དེ་བཞིན་གཤེགས་པ་སྐར་རྒྱལ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་མཐའ་ཡས་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Tiṣya will be born in a place called Light of Infinite Splendor.

source: ཡབ་ནི་ཡོན་ཏན་རིན་ཆེན་ཏོག་འོད་གྲགས་ཞེས་བྱའོ། །
en: Famed Luminous Crest of Precious Qualities will be his father.

source: ཡུམ་ནི་སྤོབས་པའི་རྒྱན་བཀོད་པའི་རྒྱལ་མོ་ཞེས་བྱའོ། །
en: Queen of the Array of the Ornaments of Acumen will be his mother.

source: སྲས་ནི་ཡོན་ཏན་རིན་ཆེན་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། །
en: Superknowledge of Precious Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་བདུད་རྣམ་པར་སྐྲག་པར་བྱེད་པ་གཞན་གྱིས་མི་ཐུབ་པའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Possessor of Indomitable Mind Who Terrifies the Māras will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བག་ཚ་བ་མེད་པས་རྣམ་པར་རྩེ་བའི་མངོན་པར་ཤེས་པ་ཐོབ་པ་ཞེས་བྱའོ། །
en: Attaining the Superknowledge of Undaunted Love will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རབ་ཀྱི་རྩལ་གྱིས་རྣམ་པར་གནོན་པ་ཐུབ་པ་མེད་པའི་ཚོགས་ཅན་ཞེས་བྱའོ། །
en: Possessor of the Gathering of Unconquerable Overpowering Energy will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be fifty consecutive congregations of hearers, each of them gathering three billion.

source: དེ་བཞིན་གཤེགས་པ་ཉི་མ་སྐྱེ་བའི་ཡུལ་ནི་ཉི་མའི་འོད་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Sūrya will be born in a place called Array of Sunlight.

source: འོད་ནི་སྟོང་གཉིས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་མོ། །
en: His light will extend as far as a millionfold universe.

source: ཡབ་ནི་ཕྱོགས་གསལ་གྲགས་ཞེས་བྱའོ། །
en: Renowned Illumination of the Directions will be his father.

source: ཡུམ་ནི་ཉི་མའི་སྙིང་པོ་འོད་ཅེས་བྱའོ། །
en: Light of the Essence of the Sun will be his mother.

source: སྲས་ནི་དྲི་མེད་འོད་འཕྲོ་ཏོག་འབྱུང་བློ་ཞེས་བྱའོ། །
en: Mind of the Emerging Crest of Stainless Light will be his son.

source: རིམ་གྲོ་པ་ནི་འཇིག་རྟེན་གྱི་སྤྱོད་པ་བས་མཆོད་པའི་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Array of Offerings through Conduct in the World will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྩོན་འགྲུས་བརྟན་པོས་ཕ་རོལ་གནོན་པར་གྲགས་པ་མ་སྨད་པ་ཞེས་བྱའོ། །
en: Perfect Renown for Subduing Adversaries with Stable Diligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་རིན་པོ་ཆེའི་མེ་ཏོག་རྣམ་པར་རྩེ་བའི་དབྱངས་ཅན་ཞེས་བྱའོ། །
en: Endowed with the Playful Melody of the Flowers of Precious Wisdom will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དགུ་བཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་དུང་ཕྱུར་ཕྲག་རེ་རེའོ། །
en: There will be ninety-six consecutive congregations of hearers, each of them gathering one hundred million irreversible bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་འདམ་ལས་རྒལ་བ་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་བཀོད་པ་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Uttīrṇapaṅka will be born in a place called Infinite Array of Joy.

source: འོད་ནི་སྟོང་གསུམ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་མོ། །
en: His light will extend as far as a trichiliocosm.

source: ཡབ་ནི་ཆུ་བོ་སྤོང་ཞེས་བྱའོ། །
en: Abandoning the Rivers will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་རིན་ཆེན་རྒྱ་མཚོའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligence of an Ocean of Precious Qualities will be his mother.

source: སྲས་ནི་དབྱངས་སྙན་བཀོད་པའི་སེམས་ཞེས་བྱའོ། །
en: Mind of the Array of Melodies will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་མེ་ཏོག་མངོན་པར་ཤེས་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Superknowledge of the Flower of Wisdom will be his attendant.
